// package practice_6;


// public class Data_structure {
//1. Хранение уникальных идентификаторов пользователей
//В системе есть список уникальных идентификаторов пользователей. Необходимо быстро проверять, присутствует ли пользователь с заданным идентификатором.
//
//
//        2. Очередь задач для обработки
//Система должна обрабатывать запросы в порядке их поступления. Требуется поддерживать последовательность.
//
//
//3. Хранение ключей и значений
//Необходимо хранить настройки приложения, где каждый параметр имеет имя (ключ) и значение.
//
//
//        4. Иерархия сотрудников компании
//Требуется сохранить данные о сотрудниках в виде дерева: каждый сотрудник имеет подчинённых.
//
//
//        5. Поиск элементов по приоритету
//Система обрабатывает задачи, причём приоритет задачи определяет, когда она будет выполнена.
//
//
//6. Управление друзьями пользователя
//Требуется хранить связи между пользователями в социальной сети, где каждый пользователь может быть связан с несколькими другими.
//
//
//        7. Упорядоченный список
//Необходимо хранить список чисел в отсортированном виде, чтобы быстро находить минимальное и максимальное значения.
//
//
//8. Учет посещений страниц
//Система должна отслеживать уникальные посещения страниц на веб-сайте и вести подсчёт общего числа посещений.
//
//        Подсказка: выбор структуры данных может быть разный в зависимости от уточнения, уникальные ИЛИ не уникальные общие посещения мы считаем.
//
//
//9. История действий пользователя
//Необходимо хранить список последних действий пользователя, чтобы можно было отменить или повторить действия.
//
//
//        10. Структура телефонной книги
//Требуется хранить имена и номера телефонов, чтобы быстро находить номер по имени.
//
//
//11. Проверка корректности скобочной последовательности
//Пользователь вводит строку, содержащую скобки. Нужно определить, правильно ли расставлены скобки.
//
//
//12. Хранение объектов с частым доступом
//Требуется хранить фиксированное количество элементов, которые часто изменяются, с быстрым доступом к любому из них.
//
//
//13. Уникальные слова в тексте
//        Дан текст, нужно сохранить все уникальные слова и определить их количество.
//
//
//        14. Структура электронной очереди
//В поликлинике пациенты записываются в очередь, и каждый должен быть вызван в порядке записи.
//
//
//15. Список дел
//Требуется сохранить список задач, который можно пополнять, удалять и сортировать по сроку выполнения.
//
//
//16. Анализ частоты слов
//        Требуется определить, сколько раз каждое слово встречается в тексте.
//
//
//        17. Система рейтингов
//Вам нужно хранить список игроков с их рейтингами, чтобы быстро находить игрока с самым высоким рейтингом.
//
//
//18. Проверка дубликатов в потоке данных
// Данные поступают в потоковом режиме, и нужно проверять, был ли данный элемент уже получен ранее.

//}

